In [333]:
import pandas as pd
import numpy as np

In [334]:
np.random.seed(1)
np1= np.random.randint(0,100,30).reshape(5,6)
np1

array([[37, 12, 72,  9, 75,  5],
       [79, 64, 16,  1, 76, 71],
       [ 6, 25, 50, 20, 18, 84],
       [11, 28, 29, 14, 50, 68],
       [87, 87, 94, 96, 86, 13]])

In [335]:
df = pd.DataFrame(np1)
df.columns=['A','B','C','D','E','F']
df.index=['a','b','c','d','e']
df

    A   B   C   D   E   F
a  37  12  72   9  75   5
b  79  64  16   1  76  71
c   6  25  50  20  18  84
d  11  28  29  14  50  68
e  87  87  94  96  86  13

הצגת עמוד A

In [336]:
df['A']#

a    37
b    79
c     6
d    11
e    87
Name: A, dtype: int32

הצגת שורה b

In [337]:
df.loc['b']

A    79
B    64
C    16
D     1
E    76
F    71
Name: b, dtype: int32

הצגת תא C c

In [338]:
df['C']['c']

50

In [339]:
df.loc
df.iloc

In [340]:
df.drop(columns='D')

    A   B   C   E   F
a  37  12  72  75   5
b  79  64  16  76  71
c   6  25  50  18  84
d  11  28  29  50  68
e  87  87  94  86  13

In [341]:
df.drop(index='d')

    A   B   C   D   E   F
a  37  12  72   9  75   5
b  79  64  16   1  76  71
c   6  25  50  20  18  84
e  87  87  94  96  86  13

In [342]:
df['G'] = df['E']+ df['F']
df

    A   B   C   D   E   F    G
a  37  12  72   9  75   5   80
b  79  64  16   1  76  71  147
c   6  25  50  20  18  84  102
d  11  28  29  14  50  68  118
e  87  87  94  96  86  13   99

In [343]:
df[df['C'] > 30]

    A   B   C   D   E   F    G
a  37  12  72   9  75   5   80
c   6  25  50  20  18  84  102
e  87  87  94  96  86  13   99

In [344]:
df[df['C'] > 30].loc['e']

A    87
B    87
C    94
D    96
E    86
F    13
G    99
Name: e, dtype: int32

In [345]:
df[(df['B'] > 20) & (df['D'] < 80)]

    A   B   C   D   E   F    G
b  79  64  16   1  76  71  147
c   6  25  50  20  18  84  102
d  11  28  29  14  50  68  118

In [346]:
df[(df['B'] > 20) & (df['D'] < 80)].loc['b']

A     79
B     64
C     16
D      1
E     76
F     71
G    147
Name: b, dtype: int32

In [347]:
df[df > 50]

      A     B     C     D     E     F    G
a   NaN   NaN  72.0   NaN  75.0   NaN   80
b  79.0  64.0   NaN   NaN  76.0  71.0  147
c   NaN   NaN   NaN   NaN   NaN  84.0  102
d   NaN   NaN   NaN   NaN   NaN  68.0  118
e  87.0  87.0  94.0  96.0  86.0   NaN   99